{
  "blogs": [
    {
      "title": "Is Mac better than Windows ??",
      "description": "The author discusses which OS is better ..",
      "userId": "116086005617784227803",
      "id": 1,
      "content": "Personally I prefer macOS for a number of reasons.  It’s more stable. It simply doesn’t crash anywhere close to a Windows PC. In fact in 2.5 years of having my MacBook I have not once had a full system crash. I’ve had the odd app that needed a “Forced Quit” but that too has been rare. I have switched to using macOS at home and Windows 10 for work. It really is night and day. The GUI is cleaner. The last time Microsoft had a good interface was Windows 7 and even then, macOS beats it in both design and functionality. I don’t know how I would describe the current Windows Start Menu but it leaves a lot to be desired. Messages works great from both macOS and my iPhone. It’s easy to start a conversation on one device but then continue it on the other should I arrive at my desk or need to leave and text on the go. I can receive calls within macOS as long as my phone is on the same network. No extra software required. Safari is a great browser and I much prefer it over Chrome or Microsoft Edge or Internet Explorer. Malware and viruses are practically non-existent. My parents have a Windows 10 PC and I also gave them an older MacBook for when they travel. Whenever I go over I usually do a malware scan of their computer. Windows 10 - 600 items… riddled which I then cleaned and finally took Admin rights away from my dad. MacOS? Zero… Microsoft Office 365 works just as well if not better than what I experience with it at work. At work on a Windows 10 I frequently have Outlook crashes, Excel spreadsheets ghosting parts of the interface (literally blocks go missing from the Excel window). At home though I have little need for Office but when I do need it, works well. iCloud works pretty flawlessly between my iPhone, MacBook and iPad. After having multiple sync issues between OneDrive files I was sharing with my wife when I was still running Windows 10 myself at home I looked to other options like DropBox. Now we use that for sharing and I use iCloud to store my photos and other files. Whenever I change to a new iPhone I just need to login to iCloud and everything is there waiting for me in the Photos or Files apps. The trackpad on a MacBook is second to none. It’s seriously the only one I’ve ever used that has made me think I could get by without a mouse. So smooth to use… Notifications are actually useful in macOS and easily silenced or responded to. Family Sharing allows me to share music or movies with the kids or to enable Ask To Buy to ensure they don’t rack up credit card charges when they want to buy something and it allows me to approve their purchases (even free ones) so I can make sure my wife and I are OK with what apps they are downloading before they download them. Works on both iOS and macOS. I could go on but I think I’ve covered a lot above. There’s a reason that Microsoft and Google are now just basically copying Apple today. You pay more for the Apple brand but when you compare specs with similarly spec’d Windows laptops it isn’t really all that much more. For the better experience and better build quality, I’m willing to pay a little more for a computing experience with fewer hassles. CREDITS : https://www.quora.com/Do-you-prefer-macOS-or-Windows-and-why" 
    },
    {
      "title": "Why do people like Tesla cars?",
      "description": "I own a Tesla. I've also crashed one.",
      "content": "I think I'm qualified to answer. First off, I don't like my Tesla, I love it.  I originally wanted to buy a Ferrari. It's always been my dream car, ever since I was a kid. In early 2013, I was flying out to Chicago to buy a Ferrari 430 (my favourite model), and got screwed out of a deal. It was the best thing that happened to me.  A few weeks later, I was walking in Yorkdale Mall (the one with the famous Fashion Santa) and saw the Tesla store. This was back in early 2013 - Tesla (the Model S) hadn't won any major awards (later that year it went on to win Car of the Year, then later, Car & Driver called it the Car of the Century). You have to remember, that in 2013 Tesla wasn't as mainstream as it is today. It was a relatively unknown brand but I loved the lines & look of the vehicle so I decided to step into the store.  The moment I sat in the car, I immediately fell in love. I asked to take the car for a test drive, but they were hesitant and said the next test drive appointment was a few weeks out. I knew that wasn't true. I knew it was because I was very young (I was 31 at the time - I looked like I was 26-ish). They confirmed my suspicions when they mentioned the fact that they get a lot of university kids who just want to take it out for a joyride. I explained to him that I was serious about the car and told him I was ready to fly to Chicago two weeks ago and buy a Ferrari. He smiled, probably thinking I was full of it, but I was persistent. I was interested in the car. After some back and forth and convincing him I was sincere about the car, he finally grabbed the FOB key. We walked to the underground parking (where the chargers and cars are) and walked me through how the car worked: no ignition, no oil, no gas, no need to unlock the car. Just walk up to it, the handles will come out, step on the brakes and the car is on. It was FREAKY. It's like I travelled to the future. I couldn't even tell if the car was on! There was no sound, no noise, nothing.  We went out for a quick spin, he asked me to get on the highway and to floor it on the on-ramp. I did. It was exhilarating. There were no gears. The car sped up so fast, I can only compare the feeling to an airplane taking off. You don't feel changes in the transmission (because there is none); it's just this constant, unbelievable speed. Never in my life had I been in a car that fast.  When we got back to the store, I bought the car on the spot. Literally, did my configuration in 15 minutes (I picked all the options) and debated the colour with my wife for a few minutes and ordered my P85+ in pearl white, with all the options (I can fit 7 people in my Tesla - 5 adults, 2 kids in the trunk).  That's the back story of how [quickly] I bought the Tesla. I dropped $140,000+ on the car, on the spot (full transparency: I believe it was a $4K deposit, then the rest due when I picked up the car - regardless, the amount was the same - $140K+). That's how much I loved the car. Believe me, nothing on the market comes close to it.  Now, here's a summary of why it's such a great car (and this is by no means the exhaustive list of reasons, but the ones that jump out at me as I write this answer):  No gas. No emissions. Self explanatory. If it's good for the earth, then it's good for me. Safety: It's the safest car ever created. Literally, it's the safest car, in the history of cars. I can attest to his. I was side-swiped by an 84 year-old man who didn't see me. I tried avoiding it but he ended up pushing me onto oncoming traffic. I hit a Dodge Caravan head on. The van was was a complete write off. Mine had primarily all cosmetic damage. Batteries were fine, motor was intact and since there's front trunk space, there was no mechanical damage. More importantly, I was okay. Since I was okay (and so was everyone else, including the 84 year old that left the scene), I giggled to myself when I saw how great the car still looked after being in a head on collision. Scroll-up for a sec and look at the pic again - looks great, doesn't it? Tesla even called me to see if I was okay and needed assistance. It's crazy - they KNOW when you've been in a major collision. I'll talk about how amazing the customer service is shortly. HOV: I can't speak for the US, but in Canada, the Tesla allows me to drive in the HOV lanes. When I have to meet clients in Toronto, on average, it saves me about an hour each way. That's about 2 hours a day when I do have to commute. Numerically speaking, every hour I save, I give it a value of $500/hour - I value my spare time & time in general. Tesla gives me more time by saving it. Technology is out of this world: In the winter, I never go into a cold car. Right now, it's -6 degrees Celsius (that's 21 Fahrenheit). I have to head out to a meeting soon so I'm warming up the car. It's now 12.5 degrees Celsius (54 Fahrenheit). I'll wait until it gets to be at least 20 degrees before I hop in. I hate the winter - Tesla makes it a bit more tolerable.",
      "userId": "116086005617784227803",
      "id": 2
    }
  ]
}