{
  "blogs": [
    {
      "title": "Is Mac better than Windows ??",
      "description": "The author discusses which OS is better ..",
      "userId": "116086005617784227803",
      "id": 1,
      "content": "Personally I prefer macOS for a number of reasons.  It’s more stable. It simply doesn’t crash anywhere close to a Windows PC. In fact in 2.5 years of having my MacBook I have not once had a full system crash. I’ve had the odd app that needed a “Forced Quit” but that too has been rare. I have switched to using macOS at home and Windows 10 for work. It really is night and day. The GUI is cleaner. The last time Microsoft had a good interface was Windows 7 and even then, macOS beats it in both design and functionality. I don’t know how I would describe the current Windows Start Menu but it leaves a lot to be desired. Messages works great from both macOS and my iPhone. It’s easy to start a conversation on one device but then continue it on the other should I arrive at my desk or need to leave and text on the go. I can receive calls within macOS as long as my phone is on the same network. No extra software required. Safari is a great browser and I much prefer it over Chrome or Microsoft Edge or Internet Explorer. Malware and viruses are practically non-existent. My parents have a Windows 10 PC and I also gave them an older MacBook for when they travel. Whenever I go over I usually do a malware scan of their computer. Windows 10 - 600 items… riddled which I then cleaned and finally took Admin rights away from my dad. MacOS? Zero… Microsoft Office 365 works just as well if not better than what I experience with it at work. At work on a Windows 10 I frequently have Outlook crashes, Excel spreadsheets ghosting parts of the interface (literally blocks go missing from the Excel window). At home though I have little need for Office but when I do need it, works well. iCloud works pretty flawlessly between my iPhone, MacBook and iPad. After having multiple sync issues between OneDrive files I was sharing with my wife when I was still running Windows 10 myself at home I looked to other options like DropBox. Now we use that for sharing and I use iCloud to store my photos and other files. Whenever I change to a new iPhone I just need to login to iCloud and everything is there waiting for me in the Photos or Files apps. The trackpad on a MacBook is second to none. It’s seriously the only one I’ve ever used that has made me think I could get by without a mouse. So smooth to use… Notifications are actually useful in macOS and easily silenced or responded to. Family Sharing allows me to share music or movies with the kids or to enable Ask To Buy to ensure they don’t rack up credit card charges when they want to buy something and it allows me to approve their purchases (even free ones) so I can make sure my wife and I are OK with what apps they are downloading before they download them. Works on both iOS and macOS. I could go on but I think I’ve covered a lot above. There’s a reason that Microsoft and Google are now just basically copying Apple today. You pay more for the Apple brand but when you compare specs with similarly spec’d Windows laptops it isn’t really all that much more. For the better experience and better build quality, I’m willing to pay a little more for a computing experience with fewer hassles. CREDITS : https://www.quora.com/Do-you-prefer-macOS-or-Windows-and-why"
    }
  ]
}